#+TITLE: Positional Lexers
#+DATE: <2014-01-26 Sun>
#+AUTHOR: aki
#+EMAIL: aki@utahraptor
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not LOGBOOK) date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil stat:t tags:t
#+OPTIONS: tasks:t tex:t timestamp:t toc:t todo:t |:t
#+CREATOR: Emacs 24.3.1 (Org mode 8.0.3)
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export

** the actual lexer

The `makeLexer` function isn't that difficult to write. It doesn't differ much from the previous lexer (although keep in mind we aren't dealing with dotted pairs any more), and the biggest change is really just the bookkeeping of using the right position at the time of token construction:

#+BEGIN_SRC sml
  fun makeLexer (rdr : (char * Pos.t, 'a) reader) : (token * Pos.t, 'a) reader =
      let
         fun skipWS rdr s =
             case rdr s of
                 NONE => s
               | SOME ((#" ", _), s') => skipWS rdr s'
               | SOME ((_   , _), s') => s
      in
         fn s =>
            case rdr (skipWS rdr s) of
                NONE => NONE
              | SOME ((#"(", p), s') => SOME ((LParen, p), s')
              | SOME ((#")", p), s') => SOME ((RParen, p), s')
              | SOME ((_, p), s') =>
                case getAtom (rdr, skipWS rdr s) of
                    NONE => NONE
                  | SOME (atom, s') => SOME ((Atom atom, p), s')
      end
#+END_SRC

The function `getAtom` that extracts an atom as a string from the stream is largely unchanged, but there is again some extra bookkeeping, in this case updating the pattern matching to just ignore the position that's attached to every character.

#+BEGIN_SRC sml
  fun getAtom (rdr : ((char * Pos.t), 'b) reader, s : 'b) : (string * 'b) option =
      let
         fun done [] _ = NONE
           | done acc s = SOME (String.implode (rev acc), s)

         fun getAtom' acc s =
             case rdr s of
                  NONE => done acc s
                | SOME ((#"(", _), rest) => done acc s
                | SOME ((#")", _), rest) => done acc s
                | SOME ((x,    _), rest) =>
                  if Char.isSpace x then
                     done acc s
                  else getAtom' (x :: acc) rest
      in
         getAtom' [] s
      end
#+END_SRC

Along with the supporing infrastructure, we can now use this code to tokenize any stream (with a suitable reader implementation) into tokens with character position attached to them. For instance, given a regular character reader that operates on strings (this is inefficient, but fine for our purposes):

#+BEGIN_SRC sml
  fun getc1 "" = NONE
    | getc1 s  = SOME (String.sub (s, 0), String.substring (s, 1, size s - 1))
  
  val SOME (#"f", "oo") = getc1 "foo"
#+END_SRC

#+RESULTS:
: val getc1 = fn : string -> (char * string) option

And a positional reader constructed from our string reader:

#+BEGIN_SRC sml
  val getc2 = Pos.reader getc1
  
  val SOME ((#"f", p), ("oo", p')) = getc2 (Pos.stream "foo")
  
  val 1 = Pos.line p
  val 0 = Pos.col p
  
  val 1 = Pos.line p'
  val 1 = Pos.col p'
#+END_SRC

#+RESULTS:
: val getc2 = fn : (char * Pos.t,string * Pos.t) reader
: val p = - : Pos.t
: val p' = - : Pos.t

We can finally construct a lexer, that attaches line and column numbers to tokens that it produces. This is then used by the parser to report errors, as well as attach the position of various syntax elements to the abstract syntax tree. I'll try to cover that in my next post.

#+BEGIN_SRC sml
  val lex   = Lexer.makeLexer getc2
  
  val SOME ((LParen, p), ("foo)", p')) = lex (Pos.stream "(foo)")
  val 1 = Pos.line p
  val 0 = Pos.col p
#+END_SRC

#+RESULTS:
: val lex = fn : (Lexer.token * Pos.t,string * Pos.t) reader
: val LParen = LParen : Lexer.token
: val p = - : Pos.t
: val p' = - : Pos.t

